app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys"
---
  def index
    @surveys = Survey.all

INSERT INTO "surveys" ("importante", "lineas", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["importante", "Gran potencia"], ["lineas", "Agresivas"], ["created_at", "2015-03-20 01:16:28.964615"], ["updated_at", "2015-03-20 01:16:28.964615"]]
---
  def create
    @survey = Survey.new(survey_params)
    respond_to do |format|
      if @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_survey
      @survey = Survey.find(params[:id])